Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་མ་ཡིན་པའི་ཚུལ་ཁྲིམས་ངན་པར་བྱེད་པ་དང་།
en: For bodhisattva great beings, this is the purity of ethical discipline. {

source: བྱང་ཆུབ་ཀྱི་གེགས་སུ་འགྱུར་བའི་ཆོས་གཞན་དག་ཀྱང་ཡིད་ལ་མི་བྱེད་པ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཚུལ་ཁྲིམས་ཡོངས་སུ་དག་པའོ། །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱས་པ་ཤེས་ཤིང་དྲིན་དུ་གཟོ་བ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། ཕན་པ་ཆུང་ངུ་ཞིག་བྱས་ཀྱང་འཁོར་བ་ཟད་ཀྱི་བར་དུ་ཆུད་མི་གཟོན་ན་མང་པོ་ལྟ་ཅི་སྨོས་ཏེ།
en: Dt.219} If you ask what, for bodhisattva great beings, is the gratitude and thankfulness, it is that, when bodhisattva great beings practice the conduct of a bodhisattva, until cyclic existence has come to an end, they never squander any benefit they have had, however small, let alone a major one.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱས་པ་ཤེས་ཤིང་དྲིན་དུ་གཟོ་བའོ།
en: For bodhisattva great beings, this is the gratitude and thankfulness.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་མཐུ་ལ་གནས་པ་གང་ཞེ་ན། སེམས་ཅན་ཐམས་ཅད་ལ་གནོད་སེམས་མེད་ཅིང་། འཚེ་བ་མེད་པའི་སེམས་ཏེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བཟོད་པའི་མཐུ་ལ་གནས་པའོ།
en: If you ask what, for bodhisattva great beings, is the grounding in the power of tolerance, it is that they are without malice and without inimical thoughts directed toward any being, For bodhisattva great beings, this is the grounding in the power of tolerance.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རབ་ཏུ་དགའ་ཞིང་སྤྲོ་བ་མྱོང་བར་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཐེག་པ་གསུམ་ལ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the experience of delight and joy, it is that they bring all beings to maturation in the three vehicles.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རབ་ཏུ་དགའ་ཞིང་སྤྲོ་བ་མྱོང་བར་བྱའོ།
en: For bodhisattva great beings, this is the experience of delight and joy.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བ་གང་ཞེ་ན། འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the nonforsaking of any being, it is that they provide sanctuary to all beings.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བའོ།
en: For bodhisattva great beings, this is the nonforsaking of all beings.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྙིང་རྗེ་ཆེན་པོ་མངོན་དུ་བྱ་བ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། འདི་སྙམ་དུ་སེམས་ཤིང་བདག་གིས་སེམས་ཅན་རེ་རེའི་དོན་དུ་ཡང་བསྐལ་པ་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དུ་སེམས་ཅན་དམྱལ་བར་གནས་པར་བྱ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the actualizing of great compassion, it is that when bodhisattva great beings practice the conduct of a bodhisattva, they think, ‘For the sake of each being I will remain among the denizens of the hells for eons numbering as many as the grains of sand of the river Gaṅgā.

source: སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་མ་བཀོད་ཀྱི་བར་དུ་དེ་དག་དུ་གཏུབ་ཅིང་གཤེགས་པ་དང་། བརྡུང་ཞིང་བཙོ་བ་དང་། བསྲེག་པ་ལ་སོགས་པ་ཉམས་སུ་མྱོང་བར་བྱའོ་སྙམ་ནས།
en: Until all beings are established in the wisdom of the buddhas, I will experience in these domains being cut, pierced, beaten, roasted, burned, and so forth.’

source: དེ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དུ་སྤྲོ་ཞིང་སྐྱོ་བ་མེད་པ་སྟེ།
en: They have such fortitude and indefatigability for the sake of all beings.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྙིང་རྗེ་ཆེན་པོ་མངོན་དུ་བྱ་བའོ།
en: For bodhisattva great beings, this is the actualizing of great compassion.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བླ་མ་བསྙེན་བཀུར་ཞིང་། དད་པས་གུས་པར་བྱ་བ་གང་ཞེ་ན། འདི་ལྟར་བླ་མ་རྣམས་ལ་སྟོན་པའི་འདུ་ཤེས་སུ་བྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the respect for and veneration of the spiritual teacher by means of faith for bodhisattva great beings, it is that they perceive their spiritual teachers as a buddha.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བླ་མ་ལ་བསྙེན་བཀུར་ཞིང་དད་པས་གུས་པར་བྱ་བའོ།
en: For bodhisattva great beings, this is the respect for and veneration of the spiritual teacher by means of faith.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་ཞིང་ཚོལ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལས་གཞན་མེད་པར་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། ལས་གཞན་མེད་པར་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཡོངས་སུ་ཚོལ་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the perseverance in and searching for the perfections, it is that, in order to bring all beings to maturation, without doing anything else they search for the perfections, with no other activity.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་ཞིང་ཚོལ་བའོ།
en: For bodhisattva great beings, this is the perseverance in and searching for the perfections. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མང་དུ་ཐོས་པས་མི་ངོམས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་འདིའམ། ཕྱོགས་བཅུ་ཀུན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་གང་ཅི་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བར་བྱའོ། །ཞེས་མི་ངོམས་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the insatiable thirst for erudition, it is the insatiability of thinking, ‘I will retain in mind all that the blessed lord buddhas have taught in this world system and in the world systems of all the ten directions!’

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མང་དུ་ཐོས་པས་མི་ངོམས་པའོ།
en: For bodhisattva great beings, this is the insatiable thirst for erudition.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཟང་ཟིང་མེད་པར་ཆོས་ཀྱི་སྦྱིན་པ་རྣམ་པར་འབྱེད་པ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་སྟོན་པའི་ཚེ། ཆོས་ཀྱི་སྦྱིན་པ་དེས་ཆུང་ངུ་ན་བྱང་ཆུབ་ཏུ་ཡང་རེ་བ་མེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the elucidation of the gift of Dharma without expectations, it is that when bodhisattva great beings teach the Dharma, they do not hope even in the slightest for [their own] enlightenment through that gift of the Dharma.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཟང་ཟིང་མེད་པར་ཆོས་ཀྱི་སྦྱིན་པ་རྣམ་པར་འབྱེད་པའོ།
en: For bodhisattva great beings, this is the elucidation of the gift of Dharma without expectations.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་ཡོངས་སུ་བསྔོ་བ་གང་ཞེ་ན། དགེ་བའི་རྩ་བ་གང་དང་གང་གིས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཅིང་། བདག་དང་གཞན་གྱི་སེམས་ཀྱི་ཞིང་ཡོངས་སུ་སྤྱོད་པའི་ཚེ། དགེ་བའི་རྩ་བ་དེ་དག་ཡོངས་སུ་བསྔོ་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the generation and dedication of the roots of virtuous actions for the refinement of the buddhafields, it is that when they refine the buddhafields and purify the fields formed by their own and others’ minds, they dedicate those roots of virtuous action.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་དགེ་བའི་རྩ་བ་བསྐྱེད་ཅིང་ཡོངས་སུ་བསྔོ་བའོ།
en: For bodhisattva great beings, this is the generation and dedication of the roots of virtuous actions for the refinement of the buddhafields.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དཔག་ཏུ་མེད་པའི་འཁོར་བས་ཡོངས་སུ་སྐྱོ་བ་མེད་པ་གང་ཞེ་ན། དགེ་བའི་རྩ་བ་གང་གིས་ཉེ་བར་བརྟེན་ན། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་འགྱུར་བ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་ཉེ་བར་རྟོན་ཅིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་མ་རྫོགས་ཀྱི་བར་དུ།
en: If you ask what, for bodhisattva great beings, is the indefatigability in the face of the fathomless cycle of rebirth, it is that, when relying upon any roots of virtuous action, they bring beings to maturation and refine the buddhafields, they reveal such roots of virtuous action, and never tire until all-aspect omniscience has been perfected.

source: ནམ་ཡང་སྐྱོ་བར་མི་འགྱུར་བ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དཔག་ཏུ་མེད་པའི་འཁོར་བས་ཡོངས་སུ་སྐྱོ་བ་མེད་པའོ།
en: For bodhisattva great beings, this is the indefatigability in the face of the fathomless cycle of rebirth.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ལ་གནས་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སེམས་ལ་སྨོད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the maintenance of a sense of conscience and shame, it is that they spurn the mindsets of the śrāvakas and pratyekabuddhas. {

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ངོ་ཚ་ཤེས་ཤིང་ཁྲེལ་ཡོད་པ་ལ་གནས་པའོ།
en: Dt.220} For bodhisattva great beings, this is the maintenance of a sense of conscience and shame. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགོན་པ་ལ་གནས་པ་ཡོངས་སུ་མི་གཏོང་བ་གང་ཞེ་ན། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལས་འདའ་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the refusal to give up dwelling in the wilderness, it is that they go beyond the levels of the śrāvakas and the pratyekabuddhas.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགོན་པ་ལ་གནས་པ་ཡོངས་སུ་མི་གཏང་བའོ།
en: For bodhisattva great beings, this is the refusal to give up dwelling in the wilderness.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདོད་པ་ཆུང་བ་གང་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བྱང་ཆུབ་ལ་ཡང་འདོད་པ་མི་སྐྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the paucity of desires, it is that bodhisattva great beings do not have the desire even for enlightenment.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདོད་པ་ཆུང་བའོ།
en: For bodhisattva great beings, this is the paucity of desires.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོག་ཤེས་པ་གང་ཞེ་ན། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་ཀྱང་རློམ་སེམས་སུ་མི་བྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the contentment, it is that they make no assumptions, even though they have attained all-aspect omniscience.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཆོག་ཤེས་པའོ།
en: For bodhisattva great beings, this is the contentment.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱངས་པའི་ཡོན་ཏན་གྱི་སྡོམ་པ་མི་གཏང་བ་གང་ཞེ་ན། འདི་ལྟར་ཆོས་ཟབ་མོ་རྣམས་ལ་རྟོགས་པར་གཞོག་པའི་བཟོད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the nonforsaking of the vows associated with the ascetic virtues, it is that they can tolerate meditative absorption in a state of realization with respect to profound matters.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྦྱངས་པའི་ཡོན་ཏན་གྱི་སྡོམ་པ་མི་གཏང་བའོ།
en: For bodhisattva great beings, this is the nonforsaking of the vows associated with the ascetic virtues.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསླབ་པ་ཡོངས་སུ་མི་གཏོང་བ་གང་ཞེ་ན། བསླབ་པ་ཐམས་ཅད་རྒྱུ་བ་མེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the nonforsaking of the [monastic] trainings, it is that they are unwavering in the [monastic] trainings.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བསླབ་པ་ཡོངས་སུ་མི་གཏང་བའོ།
en: For bodhisattva great beings, this is the nonforsaking of the [monastic] trainings.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདོད་པའི་ཡོན་ཏན་ལ་སྨད་པ་གང་ཞེ་ན། འདོད་པའི་སེམས་མི་སྐྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the spurning of the desirable attributes of the senses, it is that they do not develop thoughts of desire.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདོད་པའི་ཡོན་ཏན་ལ་སྨད་པའོ།
en: For bodhisattva great beings, this is the spurning of the desirable attributes of the senses.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མྱ་ངན་ལས་འདའ་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་གང་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the setting of the mind on the transcendence of sorrow, it is that they do not engage in the conditioning of physical forms of any phenomena.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མྱ་ངན་ལས་འདའ་བ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པའོ།
en: For bodhisattva great beings, this is the setting of the mind on the transcendence of sorrow.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྫས་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་གང་ཞེ་ན། ཕྱི་ནང་གི་ཆོས་ཐམས་ཅད་ལ་འཛིན་པ་མེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the forsaking of all substantial phenomena, it is that do not grasp any external or internal phenomena.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རྫས་ཐམས་ཅད་ཡོངས་སུ་གཏང་བའོ།
en: For bodhisattva great beings, this is the forsaking of all substantial phenomena.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཞུམ་པ་མེད་པ་གང་ཞེ་ན། རྣམ་པར་ཤེས་པ་གནས་པ་ལ། དེའི་སེམས་མི་གནས་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is undauntedness, it is that their minds do not dwell on states of consciousness.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སེམས་ཞུམ་པ་མེད་པའོ།
en: For bodhisattva great beings, this is undauntedness.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དངོས་པོ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པ་གང་ཞེ་ན། དངོས་པོ་ཐམས་ཅད་ཡིད་ལ་མི་བྱེད་པ་སྟེ།
en: If you ask what, for bodhisattva great beings, is disregard for all entities, it is that do not pay attention to any entities.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དངོས་པོ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པའོ།
en: For bodhisattva great beings, this is disregard for all entities. “

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཁྱིམ་པ་དང་བསྟེན་པ་ཡོངས་སུ་སྤང་བར་བྱ་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་ཞིང་རྫུས་ཏེ་སྐྱེ་བ་དང་། མགོ་བྲེགས་ཤིང་། ངུར་སྨྲིག་གི་གོས་བགོ་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is avoidance of intimacy with householders, it is that they proceed from buddhafield to buddhafield, take birth miraculously, have shaved heads, and wear saffron robes.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཁྱིམ་པ་དང་བསྟེན་པ་ཡོངས་སུ་སྤང་བར་བྱ་བའོ།
en: For bodhisattva great beings, this is the avoidance of intimacy with householders.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་སློང་མ་དང་བསྟེན་པ་ཡོངས་སུ་སྤང་བ་གང་ཞེ་ན། དགེ་སློང་མ་དང་སེ་གོལ་གཏོགས་པ་ཙམ་དུ་ཡང་ལྷན་ཅིག་མི་གནས་ཤིང་། དེའི་རྒྱུས་ཡོངས་སུ་སྐོམ་པའི་སེམས་མི་སྐྱེད་དེ།
en: If you ask what, for bodhisattva great beings, is the avoidance of intimacy with nuns, it is that they do not stay with a nun, even for the duration of a finger snap, and they do not have worrisome thoughts on that account.

source: དེའི་རྒྱུས་གོས་འཐོབ་པར་མི་བྱེད་པ་འདི་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དགེ་སློང་མ་དང་བསྟེན་པ་ཡོངས་སུ་སྤང་བར་བྱ་བའོ།
en: For bodhisattva great beings, this is the avoidance of intimacy with nuns.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རིགས་ལ་སེར་སྣ་བྱེད་པ་ཡོངས་སུ་སྤང་བ་གང་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདི་ལྟར་སེམས་བསྐྱེད་པར་བྱ་སྟེ། གང་བདག་གིས་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བའི་རྣམ་པ་བསྒྲུབ་པར་བྱ་བ་དེ་དང་། སེམས་ཅན་འདི་དག་རང་རང་གི་བསོད་ནམས་ཀྱིས་བདེ་བར་གྱུར་ན། དེ་ལ་བདག་གིས་སེར་སྣའི་སེམས་བསྐྱེད་པར་མི་བྱའོ་ཞེས་བྱ་བ་འདི་ནི།
en: If you ask what, for bodhisattva great beings, is the avoidance of jealousy toward those of the spiritual family, in this regard, Subhūti, it is that bodhisattva great beings should think, ‘I should work for the happiness of all beings, and if these beings are happy on account of their own merits, I should not have thoughts of jealousy toward them.’

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་རིགས་ལ་སེར་སྣ་བྱེད་པ་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: For bodhisattva great beings, this is the avoidance of jealousy toward those of the spiritual family.

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འདུ་འཛིའི་གནས་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུ་འཛིའི་གནས་གང་དུ་གནས་པས། ཉན་ཐོས་སམ། རང་སངས་རྒྱས་ཡོད་པའམ། དེ་དང་ལྡན་པའི་གཏམ་འབྱུང་བར་འགྱུར་བའམ། དེ་དང་ལྡན་པའི་སེམས་བསྐྱེད་པ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་བུར།
en: If you ask how bodhisattva great beings should avoid places of social intercourse, bodhisattva great beings should not frequent such places of social intercourse where śrāvakas or pratyekabuddhas are present, or where conversations take place about them or where their associated mindsets might arise.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནས་པར་མི་བྱ་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདུ་འཛིའི་གནས་ཡོངས་སུ་སྤང་བའོ།
en: For bodhisattva great beings, this is the avoidance of places of social intercourse.

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནོད་སེམས་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། གནོད་སེམས་དང་། འཚེ་བའི་སེམས་ཀྱི་སྐབས་མི་འབྱེད་ཅིང་། ཐབ་མོའི་སེམས་སམ། རྩོད་པའི་སེམས་ཀྱི་གོ་མི་འབྱེད་པ་སྟེ།
en: If you ask how bodhisattva great beings should avoid malice, it is that there is no opportunity for thoughts of malice or harm [to arise], and there is no occasion for thoughts of struggle or strife.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གནོད་སེམས་ཡོངས་སུ་སྤང་བའོ།
en: For bodhisattva great beings, this is the avoidance of malice.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདག་བསྟོད་པ་ཡོངས་སུ་སྤང་བ་གང་ཞེ་ན། ནང་གི་ཆོས་རྣམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the avoidance of self-praise for bodhisattva great beings, {Dt.221} it is that they do not observe internal phenomena.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་བདག་བསྟོད་པ་ཡོངས་སུ་སྤང་བའོ།
en: For bodhisattva great beings, this is the avoidance of self-praise.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གཞན་སྨོད་པ་ཡོངས་སུ་སྤོང་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕྱི་རོལ་གྱི་ཆོས་རྣམས་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is the avoidance of disparaging others, it is that they do not observe external phenomena.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་གཞན་སྨོད་པ་ཡོངས་སུ་སྤང་བའོ།
en: For bodhisattva great beings, this is the avoidance of disparaging others. “

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། དེ་དག་ནི་འདི་ལྟར་བདེ་འགྲོ་ལ་ཡང་བར་དུ་གཅོད་ན། འཕགས་པའི་ལམ་ལ་ལྟ་ཅི་སྨོས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཀྱིས། སྤང་བར་བྱའོ་ཞེས་སྤོང་བ་སྟེ།
en: If you ask how bodhisattva great beings should avoid the paths of the ten nonvirtuous actions, it is that those [paths] should be avoided since they obstruct progress to the higher realms [of rebirth], not to mention the path of the noble ones, or unsurpassed, complete enlightenment.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ཡོངས་སུ་སྤང་བར་བྱ་བའོ།
en: For bodhisattva great beings, this is the avoidance of the paths of the ten nonvirtuous actions.

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལྷག་པའི་ང་རྒྱལ་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་མེད་ན། གང་གིས་ང་རྒྱལ་དུ་འགྱུར་བའི་ལྷག་པ་ལྟ་ཅི་སྨོས་ཤེས་ང་རྒྱལ་དུ་མི་བྱེད་པ་སྟེ།
en: If you ask how bodhisattva great beings should avoid exalted pride, it is that since they do not observe anything at all, let alone an exaltedness through which they would resort to pride, they do not indulge in pride.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ལྷག་པའི་ང་རྒྱལ་ཡོངས་སུ་སྤང་བར་བྱ་བའོ།
en: For bodhisattva great beings, this is the avoidance of exalted pride.

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཁེངས་པ་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་གང་ལ་ཁེངས་པ་སྐྱེ་བར་འགྱུར་བ་དེ་ལྟ་བུའི་དངོས་པོ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: If you ask how bodhisattva great beings should avoid conceit, it is that they do not observe any entity with respect to which conceit might arise.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཁེངས་པ་ཡོངས་སུ་སྤང་བར་བྱ་བའོ།
en: For bodhisattva great beings, this is the avoidance of conceit.

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཕྱིན་ཅི་ལོག་རྣམས་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། དངོས་པོར་མི་དམིགས་པ་སྟེ།
en: If you ask how bodhisattva great beings should avoid distorted views, it is that they do not apprehend entities.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱིན་ཅི་ལོག་རྣམས་ཡོངས་སུ་སྤང་བར་བྱ་བའོ།
en: For bodhisattva great beings, this is the avoidance of distorted views.

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཉམ་རངས་སུ་མི་འདོར་བ་ཡིན་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་གཏི་མུག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་སྟེ།
en: If you ask what, for bodhisattva great beings, is tolerance of desire, hatred, and delusion, it is that they do not observe desire, hatred, or delusion.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ཉམ་རངས་སུ་མི་འདོར་བའོ།
en: For bodhisattva great beings, this is tolerance of desire, hatred, and delusion. “

source: །དེ་ལས་དྲུག་ལ་ཆོས་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་གང་ཞེ་ན། འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་སྟེ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Apart from these, if you ask what are the six attributes that should be perfected on the sixth [level], they comprise the six perfections.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་སྟེ།
en: That is to say, the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom should be perfected.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་པོ་འདི་དག་ལ་གནས་ཏེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་རྣམས་ཤེས་པར་བྱ་བའི་རྒྱ་མཚོ་ལྔའི་ཕ་རོལ་དུ་ཕྱིན་པར་གྱུར་ཏོ། །ཕྱིན་ཏོ།
en: If you ask why, it is while abiding in these six perfections that the lord buddhas, the śrāvakas, and pratyekabuddhas have gone, are going, and will go to the other shore of the five oceans of knowledge.

source: །ཕྱིན་པར་འགྱུར་རོ། །ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདས་པ་དང་། མ་འོངས་པ་དང་།
en: If you ask what are these five [oceans of knowledge], they comprise the past, the future, the present, the inexpressible, and the unconditioned.

source: ད་ལྟར་བྱུང་བ་དང་། བརྗོད་དུ་མེད་པ་དང་། འདུས་མ་བྱས་ཏེ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱའོ།
en: So it is that bodhisattva great beings should perfect the six perfections. “

source: །དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་དྲུག་ཡོངས་སུ་སྤང་བར་བྱ་བ་ཡིན་ཞེ་ན། འདི་ལྟར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་པས། ཉན་ཐོས་ཀྱི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: If you ask how bodhisattva great beings should avoid six phenomena, it is that they should avoid the mindset of the śrāvakas because it is not the path to enlightenment.

source: །འདི་ལྟར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་པས་རང་སངས་རྒྱས་ཀྱི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: It is that they should avoid the mindset of the pratyekabuddhas because it is not the path to enlightenment.

source: །འདི་ལྟར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་པས་སྲིད་པའི་སེམས་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: It is that they should avoid thoughts of anxiety because they are not the path to enlightenment.

source: །འདི་ལྟར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་པས་སློང་མོ་བ་མཐོང་ན་སེམས་ཞུམ་པ་མི་བསྐྱེད་དོ།
en: It is that they should be undaunted when they see beggars because discouragement is not the path to enlightenment.

source: །འདི་ལྟར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་པས་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་ཡིད་མི་བདེ་བར་མི་བྱའོ།
en: It is that they should not be unhappy on account of having renounced all material phenomena because these are not the path to enlightenment.

source: །འདི་ལྟར་དེ་ནི་བྱང་ཆུབ་ཀྱི་ལམ་མ་ཡིན་པས་ཐོག་མ་སེམས་བསྐྱེད་ནས་ཁ་ཟ་ཡག་གི་སེམས་སུ་མི་བྱའི། སྦྱིན་པ་ཡོངས་སུ་གཏང་བར་བྱའོ་ཞེས་བྱ་བ་སྟེ།
en: It is that they should not have ill thoughts from the time when they first set their minds on enlightenment because that is not the path to enlightenment, but rather they should undertake acts of generosity [without ill thoughts].

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་དྲུག་ཡོངས་སུ་སྤང་བར་བྱའོ།
en: So it is that bodhisattva great beings should avoid these six phenomena. “
